package backend.academy.repos;

import java.util.HashMap;
import java.util.Map;
import java.util.Set;

@SuppressWarnings({"AnonInnerLength", "MultipleStringLiterals"})
public class WordsRepository {
    private final Map<String, String> words = new HashMap<>() {
        {
            put("яблоко", "фрукт");
            put("машина", "транспорт");
            put("слон", "животное");
            put("компьютер", "программист");
            put("роза", "цветок");
            put("лев", "животное");
            put("банан", "фрукт");
            put("поезд", "транспорт");
            put("стул", "мебель");
            put("телефон", "без чего современному человеку не обойтись");
            put("подсолнух", "цветок");
            put("собака", "животное");
            put("виноград", "фрукт");
            put("диван", "мебель");
            put("планшет", "аналог телефону");
            put("маргаритка", "цветок");
            put("кошка", "животное");
            put("апельсин", "фрукт");
            put("автобус", "транспорт");
            put("шкаф", "мебель");
            put("телевизор", "что смотрят скуфы каждый день");
            put("лилия", "цветок");
            put("тигр", "животное");
            put("груша", "фрукт");
            put("мотоцикл", "транспорт");
            put("полка", "мебель");
            put("камера", "помогает запечатлеть момент на всю жизнь");
            put("тюльпан", "цветок");
            put("медведь", "животное");
            put("клубника", "фрукт");
            put("самолёт", "транспорт");
            put("купюра", "это еще называют капустой");
            put("наушники", "средство абстрагирования от всего");
            put("орхидея", "цветок");
            put("волк", "животное");
            put("ананас", "фрукт");
            put("корабль", "транспорт");
            put("гардероб", "там где одежда");
            put("смарт-часы", "который час?");
            put("гвоздика", "цветок");
            put("кролик", "животное");
            put("киви", "фрукт");
            put("самокат", "запретили в центре Спб в августе 2024");
            put("выдвижной ящик", "мебель");
            put("принтер", "связано с документами");
            put("пион", "цветок");
            put("лиса", "животное");
            put("персик", "фрукт");
            put("метро", "транспорт");
            put("книжный шкаф", "мебель");
            put("дрон", "технология");
            put("мак", "цветок");
            put("олень", "животное");
            put("арбуз", "фрукт");
            put("вертолёт", "транспорт");
            put("ночной столик", "мебель");
            put("монитор", "технология");
            put("голубика", "цветок");
            put("кенгуру", "животное");
            put("грейпфрут", "фрукт");
            put("грузовик", "транспорт");
            put("табурет", "мебель");
            put("клавиатура", "набор текста");
            put("лаванда", "цветок");
            put("панда", "животное");
            put("слива", "фрукт");
            put("велосипед", "транспорт");
            put("скамейка", "стоит в парке");
            put("мышь", "животное");
            put("гладиолус", "цветок");
            put("зебра", "животное");
            put("малина", "фрукт");
            put("фургон", "транспорт");
            put("стол", "мебель");
            put("проектор", "технология");
            put("герань", "цветок");
            put("леопард", "животное");
            put("вишня", "фрукт");
            put("круиз", "водное путешествие");
            put("кресло", "мебель");
            put("роутер", "направитель (in russian))");
            put("ноготки", "женское");
            put("жираф", "животное");
            put("манго", "фрукт");
            put("яхта", "транспорт");
            put("кот", "домашнее животное");
            put("гепард", "животное");
        }
    };

    public Set<String> getWords() {
        return words.keySet();
    }

    public String getCategory(String word) {
        return words.get(word);
    }
}
